In [1]:
import pandas as pd
pd.__version__

'0.25.1'

## [Pandas rename dataframe](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html)

In [2]:
dict_df = {
    "Student": ['A', 'B', 'C', 'D', 'E'],
     "Maths": [100, 98, 78, 89, 91],
    "Science": [67, 89, 66, 79, 90],
    "Arts": [89, 78, 67, 98, 76]
}

df = pd.DataFrame(dict_df)
df

  Student  Maths  Science  Arts
0       A    100       67    89
1       B     98       89    78
2       C     78       66    67
3       D     89       79    98
4       E     91       90    76

## Changing name of selected columns of dataframe using `columns`

In [3]:
df.rename(columns = {"Name":"Student", "Subject-1":"Math"})

  Student  Maths  Science  Arts
0       A    100       67    89
1       B     98       89    78
2       C     78       66    67
3       D     89       79    98
4       E     91       90    76

## Changing names all columns of dataframe

In [4]:
df.columns = ['Student', 'Math', 'Science', 'Arts']
df

  Student  Math  Science  Arts
0       A   100       67    89
1       B    98       89    78
2       C    78       66    67
3       D    89       79    98
4       E    91       90    76

## Changing names of indices of dataframes using parameter `index`

In [5]:
df.rename(index={0:'a', 1:'b'})

  Student  Math  Science  Arts
a       A   100       67    89
b       B    98       89    78
2       C    78       66    67
3       D    89       79    98
4       E    91       90    76

In [6]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

  Student  Math  Science  Arts
a       A   100       67    89
b       B    98       89    78
c       C    78       66    67
d       D    89       79    98
e       E    91       90    76